[{"Id":"244525a6-2fdb-49e7-aa88-88b813acd8c1","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"Oʻtkir Hoshimov","Body":"Oʻtkir Hoshimov – taniqli oʻzbek yozuvchisi va jamoat arbobi. 1941-yili 5-avgustda Toshkentda Doʻmbirobod mahallasida tugʻilgan. Toshkent (2013-yil 24-may Juma kuni ogʻir hastalik tufayli Oilasi davrasida Toshkentda vafot etgan) Davlat universiteti filologiya fakultetida oʻqigan. Turli tahririyat va nashriyotlarda ishlagan. Shuningdek, u Oʻzbekiston Respublikasi Yozuvchilar qoʻmita raisi vazifasini bajargan. Hayoti\nOʻtkir Hoshimov 1941-yil, 5-avgustda Toshkent shahrida oddiy bir oilada dunyoga keldi. Yozuvchining bolaligi urush va urushdan keyingi mashaqqatli davrga toʻgʻri keldi. „Oʻsha davrda non tanqis boʻlgani bilan kutubxonalarda kitob koʻp edi“¸ deya eslagan edi yozuvchi oʻz xotiralarida.[1]\n\nKitob oʻqish barobarida Oʻtkir Hoshimov pochtada xat tarqatuvchi boʻlib ishladi. Aynan mana shu ish Oʻtkir Hoshimovni oddiy odamlarning kitobdagi hayotdan butunlay boshqa turmushiga oshno qildi.\n\nBoʻlajak yozuvchi 1964-yilda Oʻzbekiston Milliy universitetining (sobiq ToshDU) filologiya fakulteti jurnalistika boʻlimini sirtdan tugatdi.\n\n1959–1962-yillari „Qizil Oʻzbekiston“, 1963–1966-yil „Toshkent haqiqati“ 1966–1982-yillari „Toshkent oqshomi“ gazetalarida adabiy xodim boʻlib ishladi.Uning kitoblari juda qiziqarli va hayotiy kitob hisoblanadi\n\nIjodi\nYozuvchining ilk asari 1962-yilda „Poʻlat chavandoz“ nomida ocherklar toʻplami tarzida nashrdan chiqdi. Ammo yozuvchiga muvaffaqiyat keltirgan asar 1970-yilda nashr qilingan „Bahor qaytmaydi“ qissasi boʻldi.\n\nOʻsha paytda nashr qilinayotgan mafkura targʻibotidan iborat asarlar fonida yozuvchi Oʻtkir Hoshimovning oddiy insoniy munosabatlar haqidagi bu asari qorongʻu osmonda chaqnagan mushak kabi eslanadi..\n\nBu asar asosida suratga olingan videofilm oʻz vaqtida eng koʻp tomosha qilingan asar sifatida tarixga kirdi.\n\nOʻtkir Hoshimovning bir qancha asarlari ekranlashtirilgan. „Xazon boʻlgan bahor“, „Inson sadoqati“ (1975), „Vijdon dorisi“, „Toʻylar muborak“ (1979), „Qatagʻon“ kabi drama, komediya, bir qator kinossenariylar muallifi. „Daftar hoshiyasidagi bitiklar“(2001) kitobi ijtimoiy -maʼnaviy hayotda muayyan iz qoldirgan.\n\n„Choʻl havosi“ nomli birinchi qissasi 1963 yilda bosilib chiqqan. Talabchan adib Abdulla Qahhorning eʼtiboriga sazovor boʻlgan. „Urushning soʻnggi qurboni“, „Yanga“, „Muhabbat“, „Dehqonning bir kuni“, „Umr savdosi“, „Quyosh tarozusi“, „Oq bulut, oppoq bulut“ singari oʻnlab hikoyalari, „Shamol esaveradi“ (1968), „Bahor qaytmaydi“ (1970), „Qalbingga quloq sol“ (1973), „Dunyoning ishlari“ (1982), „Ikki karra ikki-besh“ (1987) qissalari, „Nur borki, soya bor“ (1976), „Ikki eshik orasi“ (1985), „Tushda kechgan umrlar“ (1993) kabi romanlar yozgan. Adib asarlarida zamonaviy oʻzbek xalqining maʼnaviy dunyosi, milliy ruhi, urf-odatlari tasvirlangan.\n\n„Toʻylar muborak“, „Sizdan ugina, bizdan bugina“, „Vijdon dorisi“, „Inson sadoqati“, „Qatagʻon“ singari pyesalar muallif. U E. Xemenguey, K. Simonov, A. Kuprin va boshqa adiblarning asarlarini oʻzbek tiliga tarjima qilgan.\n\nOʻtgan asrning sovet mafkurasi hukmron boʻlgan 70-yillarida Oʻtkir Hoshimov Oʻzbekiston televideniesida „Bahs“ deb nomlangan eshittirishlarni olib bordi. Bu eshittirishlar yozuvchining „Qalbingga quloq sol“ ¸\u0022Dunyoning ishlari\u0022 „Nur borki, soya bor“ kabi asarlarida koʻtarilgan oʻtkir ijtimoiy muammolar haqidagi bahslarning davomi boʻldi.\n\nKeyinchalik yozuvchi „Ikki eshik orasi“(1986), „Tushda kechgan umrlar“ (1994) romanlarida zamondosh-asrdosh odamlar taqdirini¸ 20-asrning eng keskin fojiaviy hodisalari Ikkinchi jahon urushi hamda mustabid tuzumning jinoyatkorona siyosati oqibatlari bilan bogʻliq holda tahlil va talqin etishga urindi.\n\nHali Oʻzbekistonda Sovet mafkurasi hukmron boʻlgan 1990-yilda Oʻtkir Hoshimov oʻzi bosh muharrir boʻlgan „Sharq yulduzi“jurnalida Qurʼoni karimning ilk oʻzbekcha tarjimasini chop qilishga jurʼat qildi.\n\nTarixga Gorbachev hurriyati deya kirgan \u0022Qayta qurish va oshkoralik \u0022 davri Oʻtkir Hoshimovga jasorat berdi¸ deya aytish mumkin.\n\nOʻsha paytdagi Oʻzbekiston rahbariyati zehniyatida ashaddiy ateizm mavjudligi hisobga olinsa¸ bu haqiqatda jasorat namunasi deya eslanadigan qadam.\n\nToshkentdagi „Ateizm uyi“ kabi idora vakillari Qurʼon suralarida milliy kamsitish elementlari bor¸ deya „Sharq yulduzi“ jurnalida Qurʼoni karim tarjimasini chop qilinishini toʻxtatishga urinishdi.\n\nBu toʻsiqlarga qaramasdan¸ Oʻtkir Hoshimov bu tarjimani toʻligʻicha jurnalning bir necha sonlarida bosib chiqara oldi.\n\nMarhum yozuvchi 2001-yili „Buyuk xizmatlari uchun“ ordeni bilan mukofotlangan edi.\n\nNoyob iste\u0027dod sohibi O\u0027tkir Hoshimov adabiyotga Abdulla Oripov, Omon Muxtor, Shukur Holmirzayev singari bir qator tengdoshlari bilan birga adabiyotga kirib keldi. O\u0027sha paytda adabiyotimizning Oybek, G\u0027afur G\u0027ulom, Abdulla Qahhor, Maqsud Shayxzoda singari ulkan yozuvchilari hayot bo\u0027lib, ularning nazariga tushish hammaga ham nasib etavermasdi.O\u0027tkir Hoshimov esa Abdulla Qahhordek mashhur san\u0027atkor etiborini jalb qilgan yoshlardan edi. Roman qissa,hikoyalarida so\u0027z san\u0027atining azaliy muammosi-inson taqdiri va qalbining badiiy taxlili ham mavjud edi. Shoirni romanlari, hikoyalari ko\u0027pdir.\n\nUmrining soʻnggi yillarini Oʻtkir Hoshimov oʻzbek hukumatining targʻibot-tashviqot kompaniyalaridan xoliroqda oʻtkazdi. Oʻzbek prozasida zamonaviy mavzularni imkon qadar mafkuradan xoli tarzda yorita olgan taniqli yozuvchi Oʻtkir Hoshimov 2013-yil, 24-may kuni, 71 yoshida olamdan oʻtdi. Toshkentning Doʻmbirobod masjididagi juma namozidan keyin yozuvchi jasadi tuproqqa berildi.","CreatedDate":"2023-09-02T02:37:23.5539172+05:00"},{"Id":"3608205a-c356-4608-ac94-c2a833ef65eb","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"Raspberry Pi","Body":"The Raspberry Pi is a low cost, credit-card sized computer that plugs into a computer monitor or TV, and uses a standard keyboard and mouse. It is a capable little device that enables people of all ages to explore computing, and to learn how to program in languages like Scratch and Python. It’s capable of doing everything you’d expect a desktop computer to do, from browsing the internet and playing high-definition video, to making spreadsheets, word-processing, and playing games.\n\nWhat’s more, the Raspberry Pi  has the ability to interact with the outside world, and has been used in a wide array of digital maker projects, from music machines and parent detectors to weather stations and tweeting birdhouses with infra-red cameras. We want to see the Raspberry Pi being used by kids all over the world to learn to program and understand how computers work.\n\nRaspberry Pi Foundation\nThe Raspberry Pi Foundation is a registered educational charity (registration number 1129409) based in the UK. Our Foundation’s goal is to advance the education of adults and children, particularly in the field of computers, computer science and related subjects. See our stories page for more information about the Foundation’s charitable work.\n\nYou can read more about the history of Raspberry Pi and the people who have helped to make it the success it is today on our about page.","CreatedDate":"2023-09-02T02:38:48.3191223+05:00"},{"Id":"5492c58c-f071-4a5d-82b4-f5008788c8ca","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"C# programming guide","Body":"This section provides detailed information on key C# language features and features accessible to C# through .NET.\n\nMost of this section assumes that you already know something about C# and general programming concepts. If you are a complete beginner with programming or with C#, you might want to visit the Introduction to C# Tutorials or .NET In-Browser Tutorial, where no prior programming knowledge is required.\n\nFor information about specific keywords, operators, and preprocessor directives, see C# Reference. For information about the C# Language Specification, see C# Language Specification.","CreatedDate":"2023-09-02T02:40:15.4286344+05:00"},{"Id":"9b3c623e-7abf-4fad-8e63-ea2331bd6015","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"Hindlar oyga qo’nishdi, biz esa hali ham frontend va backend orasidan o’zimizga yoqganini tanlolmay o’tiribmiz","Body":"Qayerda xato qildik-ki, bizning e’tiborimizni sodda dunyoviy va o’tkinchi narsalar torta boshladi? Nima uchun boshqa xalqlar yil ketkazib bo\u0027lsa ham ilmiy salohiyatni rivojlantirib katta yutuqlarga erishishmoqda-ku, lekin biz AQSh dollari va Gentraning narxi oshganini muhokama qilmoqdamiz?\n\nIlmiy salohiyatga erishish qiyin ish emas, aslida. Buning uchun odam kunda bir yoki ikki marotaba kitob o\u0027qisa, izlansa bo\u0027ldi. Axir, Alloh yaratgan bu tabiat qoninlarini o\u0027rganish, ularning mohiyatini anglash haddan tashqari qiziqarli-ku! Bu vaqtinchalik dunyodan yaxshash maqsadimiz Gentra olib, dang\u0027illama uy qurish emas-ku.\n\nSodda tushunchalar bilan cheklanmay, quyiroq qatlamda turgan ilmlarni o\u0027rganish bizni katta murodlarga yetkazadi. Buni anglab yetish va shuning ketidan izlanish – shu emasmi maqsad?\n\nO\u0027sha amerikaliklar qila olgan narsani biz ham qila olamiz, Hindlar sun\u0027iy yo\u0027ldosh qo\u0027ndira olgan joyga, biz ham yetib bora olamiz. Baxona qidirishni bas qilsak bo\u0027ldi...\n\nIlm izlashdan to\u0027xtamang!","CreatedDate":"2023-09-02T02:41:22.8277004+05:00"},{"Id":"25e75f34-cc3e-47e4-aedb-95627e2f4d20","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"Dasturlash Fenomeni","Body":"Hech Sizda savol paydo bo\u0027lganmi: Nima uchun dasturlash tillari buncha ko\u0027p? Nima uchun avval murakkab deb sanalgan yo\u0027nalishga hozir hamma o\u0027tib ketmoqda? Bu aslida juda qiziq va fundamental savol. Python, JavaScript, Java, C# va hokazo. Ularning sonini o\u0027nta odamning qo\u0027lida ham sanab sig\u0027dirib bo\u0027lmaydi. Markazlar ko\u0027p, o\u0027rganmoqchi bo\u0027lganlar esa undanda ko\u0027p. Qizig\u0027i, hamma bemalol o\u0027rganib ketmoqda. Axir, avval bu yo\u0027nalish haqiqatdan ham murakkab muhandislik yo\u0027nalishi edi. Uni duch kelgan odam o\u0027rgana olmagan. Hozir esa xatto maktab bolasi ham yarim soat \u0022YouTube\u0027da o\u0027tirsa\u0022 bitta kalkulyator dasturini yozib bera oladi. Buning sababi nimada?\n\nTahminan 1970-yillargacha istalgan dasturiy ta\u0027minot qirilma tilida (machine code) yozilgan. Bu til odatda ikkilik sanoq sistemasida bo\u0027lgan. Albatta machine code\u0027ni dasturlash tili deb ham atab bo\u0027lmasdi. Lekin hammasi Alfred V. Aho va Jeffrey David Ullman tomonidan ishlab chiqilib, mukammalashtirilgan tarjimon dasturidan keyin o\u0027zgargan. Ushbu tarjimon dastur – kompilyator deb ataladi.\n\nAynan shu kichik dastur butun dasturlash amaliyotini tubdan o\u0027zgartirib, dasturchining kompyuter bilan bo\u0027ladigan muloqotini yangi darajaga chiqargan yuborgan. Keling hozir aynan shu o\u0027zgarishlar haqida gaplashsak:\n\n1. Kompyuter qurilmasini bilish shart emas. Dasturchi kodni yozish va ishlatish vaqtida kompyuter ichki qurilmalarining qanday ishlashini bilmasligi mumkin. Dasturning xotiradagi ishlash tartibi; protsessor ichidagi amaliyotlar; ekranga ma\u0027lumot uzatilish algoritmlari. Bularning hammasini kompilyator berkitib yuboradi. Kodni to’g’ri yozsa bo’ldi. Qurilma esa xuddi yo’qdek bo’ladi.\n2. Takrorlanishlar. Dasturchi takrorlanuvchi kodni bir martagina yozib, uni for, while yoki do...while kabi operatorlar ichiga olib qo\u0027yaveradi. Haqiqiy takrorlanish operatsiyasini kompilyator o\u0027zi kompyuterga to\u0027g\u0027ri buyurib beradi.\n3. Dasturni bo\u0027laklarga bo\u0027lish. Funksiya, protsedura kabi tushunchalar kompyuterga yot hisoblanadi, ammo uni dastur kodida dasturchi har qadamda yozadi. Kompilyator o’z o’rnida har funksiya (protsedura) chaqirilganida kerakli kodni qo’yib natijani tarjima qiladi.\n4. OOP, Functional Programming. Odamzod kod oson bo’lishi uchun obyektlar dunyosini o’ylab topib, dasturlash jarayonini mantiqan tushunarli va hayotiy bo’lishiga harakat qiladi, ammo protsessor bu narsalarni umuman tushunmaydi. Unga faqat 0 va 1 berish kerak. Biz yozaveramiz, kompilyator esa hamma yozganimizni sodda bo’lgan 0 va 1ga aylantiradi.\n\nE’tibor bergan bo’lsangiz Kompilyator juda muhim dastur ekan. Istalgan yangi til o’ylab topilishi, istalgan odamning dasturlashga kirishini osonlashishi; istalgan texnologiyaning asosini bilmay kod yozish mumkinligi aynan Kompilyatorning xizmati bilan bo’lar ekan.\n\nAna shu katta hodisani — Dasturlash Fenomeni deb nomlasa bo’ladi.","CreatedDate":"2023-09-02T02:42:53.6051322+05:00"},{"Id":"9b88b70a-766d-4052-9386-db1d73b7e116","UserId":"055b9298-83d3-4433-9dc1-5c043c6fae9f","Title":"ChatGpt ga bog\u0027lanib qolish haqida","Body":"\u0022Mohiyat menga kerak emas\u0022, yohud \u0022ChatGPT yonimda bor, istalgan muammoyingizni hal qila olaman!\u0022\n\nBir qiziq savol berishdi menga: \u0022Nima uchun aksariyat suhbatlarda ishda odatda ishlatilmaydigan narsalar so\u0027raladi? Nima uchun ChatGPTni yaxshi bilgan va unda ma\u0027lumot izlay olgan odam har doim ham ish topa olmaydi? U ham muammoni yechimini tez bera oladi-ku?\u0022\n\nOddiy bir misol keltiraman. Qaynoq choy damlangan choynak turibdi oldimizda. Agar yonimizda biror go\u0027dak paydo bo\u0027lsa, biz shu ondayoq bolani shu choynakdan uzoqlashtirishga harakat qilamiz. Nima uchun? Javob oddiy – Qaynoq suv bola tanasini kuydirib, shikast yetkazmasligi uchun. Biz buni o\u0027z tajribamizdan o\u0027tkazganimiz uchun, yoki eng kamida yaqinlarimizda ko\u0027rganimiz uchun bilamiz.\n\nQizig\u0027i shundaki, aynan shu qaynoq suvning tanaga salbiy ta\u0027siri haqida ChatGPTdan ham so\u0027rab bilsa bo\u0027ladi. Sizdan ko\u0027p narsa ham talab etilmaydi, savol bersangiz bo\u0027ldi. GPT Sizga joyida kamida 10ta gapdan iborat bir matnni ko\u0027rsatadi va unda shu zararlar haqida bayon qiladi.\n\nDiqqat savolar: GPT buni tajribasidan kelib chiqib qildimi? U ham o\u0027z ustiga qachondir shunday aynoq suvni to\u0027kib yuborganmi? O\u0027zi bayon qilayotgan narsaga u qanchalik ishonadi?\n\nTajriba va ilmning o\u0027rnini hech qaysi sun\u0027iy intellekt bosa olmaydi. Bilimi chuqur inson har bir qilayotgan ishini nima uchun qilayotganini; u qilgan ish kelajakda qanday natijalarga olib kelishini; agar u qilgan ishda muammo chiqsa qanday yechim qilish kerakligini bemalol ayta oladi.\n\nChatGPT ustingizga suv to\u0027kib bo\u0027lganingizdan keyin Sizga yordam bermaydi. U faqat o\u0027qib berishni biladi, bayon qilishni biladi, ammo shu bayonotiga hech qachon javob bera olmaydi.","CreatedDate":"2023-09-02T02:44:08.3565296+05:00"}]
